<img src="Data/books_ERD.png">

In [9]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
from urllib.parse import quote_plus as urlquote

# ## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'ManonFire12!' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/books'
engine = create_engine(connection)

In [ ]:
create_database(connection)

In [11]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Load Data and Create Tables

### Import Datasets

In [16]:
authors = pd.read_csv('Data/authors.csv')
books = pd.read_csv('Data/books.csv')
favorites = pd.read_csv('Data/favorites.csv')
users = pd.read_csv('Data/users.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

### Create Tables

In [19]:
authors.to_sql('authors', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
favorites.to_sql('favorites', engine, if_exists = 'replace')
users.to_sql('users', engine, if_exists = 'replace')

3

In [21]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [23]:
q = '''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id 
    FROM users 
    WHERE (users.last_name = "Doe" AND users.first_name = "John"));
'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1